#include "Class.Command.hpp"
#include "Class.IRC.hpp"
#include "utils.hpp"

/*
** ====================================================================
** Команда: ADMIN
** ====================================================================
** Параметры: [message]
** ====================================================================
** С сообщением AWAY, клиенты могут устанавливать автоматическую строку 
** ответа на любые PRIVMSG-команды, направленные им (не на канал). 
** Автоматический ответ посылается сервером к клиенту, пославшего команду 
** PRIVMSG. Только отвечающий сервер может быть только один, к которому 
** подсоединен клиент. 

** AWAY используется вместе с одним параметром (установка сообщения AWAY) 
** или без параметров (снятие сообщения AWAY). 
** =====================================================================
*/

int Command::cmd_admin(IRC& irc, int fd)
{
	(void)irc;
	(void)fd;
	return 0;
}
